name: "reliable-net"
layer {
  name: "input"
  type: "Input"
  top: "input"
  input_param {
    shape:
    {
      dim: 1
      dim: 1
      dim: 100 
      dim: 1
    }
  }
}

layer {
  name: "output"
  type: "Injection"
  bottom: "input"
  top: "output"
}
